In [1]:
#tipos de datos en Pandas 
#series, dataframes
import pandas as pd

In [2]:
datos = {"nombre":["pedro","juan","lorena"], "edad":[25,39,33]}
print(datos)

{'nombre': ['pedro', 'juan', 'lorena'], 'edad': [25, 39, 33]}

In [3]:
df=pd.DataFrame(datos)
print(df)

   nombre  edad
0   pedro    25
1    juan    39
2  lorena    33

In [4]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [5]:
#--------series------------
print(df["nombre"])

0     pedro
1      juan
2    lorena
Name: nombre, dtype: object

In [6]:
print(df.nombre)

0     pedro
1      juan
2    lorena
Name: nombre, dtype: object

In [7]:
df1=pd.read_csv("Precipitaciones.csv")
print(df1)

                    region  enero  febrero  marzo  abril   mayo  junio  julio  \
0                 A CORUNA  240.5    293.4   31.0   80.6  149.5  108.9   44.6
1                 ALBACETE   68.1     28.0   26.2   65.3   25.4   50.0    2.0
2                 ALICANTE   49.2      3.7   63.2   85.8   57.2   20.0    9.2
3                  ALMERIA   56.3      5.2   35.8   43.1   38.8   16.9   10.2
4                    ARABA   96.8     79.9   38.0   52.0   37.7  107.8    8.5
5                 ASTURIAS  196.9    138.4   34.4   73.1   67.4  131.2   22.5
6                    AVILA   67.6    104.5    5.6   83.4   25.7   44.4    5.5
7                  BADAJOZ   62.2     78.5    7.7   61.3   13.0   29.6    0.0
8            ILLES BALEARS   81.2      5.3   53.9   22.0   54.4   28.5    8.8
9                BARCELONA   26.8     28.4   16.4   72.2   26.0   42.3   18.7
10                 BIZKAIA  175.7    111.5   52.3   57.5   49.1  124.8   37.9
11                  BURGOS   75.8     90.1   17.2   54.2   46.0   75.5    5.8
12                 CACERES   70.5    117.3    4.3   95.1   19.5   36.2    0.2
13                   CADIZ  148.5     75.4   65.0   35.5    7.5   12.3    0.0
14               CANTABRIA  180.7    112.8   56.0   60.3   60.2  122.9   43.2
15               CASTELLON   56.6     21.6   30.6   97.3   31.7   46.1   33.9
16                   CEUTA  261.9     93.9  209.8   35.4   12.9    2.7    0.0
17             CIUDAD REAL   84.0     39.6   10.3   63.0   11.8   24.0    0.7
18                 CORDOBA   88.6     57.5    9.6   64.5   11.6   20.7    0.3
19                  CUENCA   93.6     58.4   14.8   84.8   27.0   59.5    9.0
20                GIPUZKOA  173.0    113.6   62.0   62.9   69.0  145.0   46.8
21                  GIRONA   34.9     45.4   16.0   73.2   54.2   39.9   29.4
22                 GRANADA   72.2     32.9   17.2   51.0   38.1   15.5    1.3
23             GUADALAJARA   88.4     74.3   15.5   92.7   40.6   66.5   12.3
24                  HUELVA   50.7    101.9   35.4   51.5   15.1   14.5    0.0
25                  HUESCA   84.3     52.7    5.6   72.7   42.5   71.3   23.6
26                    JAEN  100.6     66.8   10.0   53.2   18.5   31.2    0.1
27                LA RIOJA   72.8     54.2   17.6   46.5   47.1   94.8    4.1
28              LAS PALMAS   44.1     32.6    6.1    3.5    0.7    1.1    0.7
29                    LEON   92.0    128.2   19.4   56.6   48.9   77.6    6.0
30                  LLEIDA   59.3     42.0   12.6   81.7   37.5   66.9   38.6
31                    LUGO  179.5    221.7   26.6   79.5   78.4  101.7   13.5
32                  MADRID   69.3     61.7    6.1   77.0   25.7   40.0    5.6
33                  MALAGA  139.5     43.7   35.5   56.9   16.5    6.4    0.0
34                 MELILLA   44.9     20.0   45.1   57.1    9.0    3.1    0.0
35                  MURCIA   44.5      2.3   52.6   61.6   48.7   32.6    9.3
36                 NAVARRA   98.8     85.9   23.8   43.7   44.2   87.9   17.6
37                 OURENSE  138.9    234.4   10.9   98.8   65.0   86.1    5.5
38                PALENCIA   52.3     81.3    7.5   55.8   29.7   79.3    3.4
39              PONTEVEDRA  255.4    335.7   22.3  128.4  144.5   80.7   24.6
40               SALAMANCA   52.9    123.6    4.1   62.4   24.4   50.8    5.6
41  SANTA CRUZ DE TENERIFE   90.6     56.0   20.8   19.4    2.8    3.5    1.7
42                 SEGOVIA   63.3     80.5    3.3   88.5   39.8   55.6    6.3
43                 SEVILLA   91.1     54.4   24.5   60.7    9.2    8.1    0.1
44                   SORIA   75.1     63.5   12.1   67.7   70.7   85.4   10.5
45               TARRAGONA   52.7     28.4    9.7   59.6   19.0   63.8   22.4
46                  TERUEL   54.1     28.8   11.9   74.6   48.5   72.6   26.8
47                  TOLEDO   83.0     51.1    7.5   62.5   15.0   27.1    3.3
48                VALENCIA   61.9     16.8   49.3   86.4   33.8   34.2   17.1
49              VALLADOLID   29.2     69.1    4.1   65.1   24.3   58.3    1.9
50                  ZAMORA   53.0    112.0    6.8   63.7   19.8   54.2    3.1
51                ZARAGOZA   52.0     30.0    3.6   52.7   38.3   57.5   13.5

    agosto  septiembre  octubre  noviembre  diciembre   anual
0     21.8        96.5    154.5      100.8      214.8  1536.9
1     34.5        48.0     44.8       33.1       14.1   439.5
2      5.0        44.0     41.1       47.4        1.8   427.6
3      1.9        17.4     27.3       32.6        3.2   288.7
4     17.7        63.3     38.5      212.2      197.3   949.7
5     19.2        90.3     74.2      309.8      205.3  1362.7
6     14.2        97.9     91.7       33.9       47.5   621.9
7      2.7        80.5     77.6       10.2       59.3   482.6
8     10.0        73.2     55.6      229.9       18.1   640.9
9     25.7        76.0     40.6       72.8        2.2   448.1
10    26.4        98.0     53.9      371.4      282.1  1440.6
11    17.6        48.4     48.7      112.3       88.1   679.7
12     4.9        98.5    130.9        7.1       75.8   660.3
13     0.1        30.8     24.8       44.5      135.1   579.5
14    30.3       105.1     47.1      384.6      246.6  1449.8
15    57.0       106.6     15.3       47.3        4.1   548.1
16     1.5         7.6      3.7      129.2       61.8   820.4
17    16.1        39.8     88.9       23.1       34.2   435.5
18     4.7        46.0     48.1       21.0       85.4   458.0
19    33.4        58.1     99.3       39.5       32.2   609.6
20    27.0       122.8     69.4      342.0      314.7  1548.2
21    44.0        89.9     29.6      108.5       12.1   577.1
22     6.8        11.5     18.6       31.7       25.5   322.3
23    33.5        76.0     75.4       44.6       35.1   654.9
24     0.0        78.2     32.0       18.1      105.3   502.7
25    17.7        78.3     65.0       64.7       59.1   637.5
26    15.8        19.0     45.7       51.0       51.8   463.7
27    16.9        42.0     37.2      115.8       49.7   598.7
28     1.5         0.9      1.6       10.9        4.5   108.2
29     9.2        71.8     60.1       59.8      112.1   741.7
30    19.0        55.7     45.0       58.6       32.9   549.8
31    17.6        59.5    111.0      114.1      179.8  1182.9
32    30.0        63.0     84.1       25.2       36.0   523.7
33     1.2        29.9     13.1       26.5       70.9   440.1
34     1.2        49.6      1.0       34.1        5.2   270.3
35     3.3        32.4     20.1       37.4        4.2   349.0
36    28.3        64.3     45.0      161.1      186.9   887.5
37    23.0        65.9     97.5       32.6      144.5  1003.1
38     6.8        61.6     47.5       56.0       51.5   532.7
39    34.0        92.4    175.7       45.3      236.4  1575.4
40     6.7        85.0     78.6       27.1       48.4   569.6
41     3.4         3.9      8.2       50.2       25.9   286.4
42    14.4        47.1     62.5       42.9       44.8   549.0
43     0.2        46.0     29.9       20.6      114.7   459.5
44    19.4        56.5     47.0       62.9       37.7   608.5
45    43.5        88.7     25.4      115.0        5.1   533.3
46    48.1        55.0     30.9       60.0       13.2   524.5
47    18.6        70.5     94.7       16.4       29.9   479.6
48    30.9        99.3     46.1       46.6        5.5   527.9
49     3.8        54.1     40.2       41.7       35.9   427.7
50     9.6        78.5     55.3       29.0       50.3   535.3
51    13.2        61.5     27.4       76.6       23.4   449.7

In [8]:
print(type(df1))

<class 'pandas.core.frame.DataFrame'>

In [9]:
df1.head(2) #primeras filas

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
0,A CORUNA,240.5,293.4,31.0,80.6,149.5,108.9,44.6,21.8,96.5,154.5,100.8,214.8,1536.9
1,ALBACETE,68.1,28.0,26.2,65.3,25.4,50.0,2.0,34.5,48.0,44.8,33.1,14.1,439.5

In [10]:
df1.shape #filas y columnas

(52, 14)

In [11]:
df1.tail(2) #ultimas filas

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
50,ZAMORA,53.0,112.0,6.8,63.7,19.8,54.2,3.1,9.6,78.5,55.3,29.0,50.3,535.3
51,ZARAGOZA,52.0,30.0,3.6,52.7,38.3,57.5,13.5,13.2,61.5,27.4,76.6,23.4,449.7

In [12]:
df1.columns # nos muestra todas las columnas

Index(['region', 'enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio',
       'julio', 'agosto', 'septiembre', 'octubre', 'noviembre', 'diciembre',
       'anual'],
      dtype='object')

In [13]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   region      52 non-null     object
 1   enero       52 non-null     float64
 2   febrero     52 non-null     float64
 3   marzo       52 non-null     float64
 4   abril       52 non-null     float64
 5   mayo        52 non-null     float64
 6   junio       52 non-null     float64
 7   julio       52 non-null     float64
 8   agosto      52 non-null     float64
 9   septiembre  52 non-null     float64
 10  octubre     52 non-null     float64
 11  noviembre   52 non-null     float64
 12  diciembre   52 non-null     float64
 13  anual       52 non-null     float64
dtypes: float64(13), object(1)
memory usage: 5.8+ KB

In [14]:
df1.describe()

,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
count,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000
mean,92.996154,78.632692,26.684615,64.500000,38.305769,54.182692,11.840385,17.178846,62.246154,54.373077,82.494231,76.192308,659.626923
std,57.127171,67.454280,31.473913,21.421942,29.079576,36.821635,13.256390,13.939496,28.581205,36.619785,91.689789,80.409042,352.905548
min,26.800000,2.300000,3.300000,3.500000,0.700000,1.100000,0.000000,0.000000,0.900000,1.000000,7.100000,1.800000,108.200000
25%,53.825000,32.825000,9.125000,53.950000,18.875000,26.325000,1.600000,4.850000,46.000000,29.825000,32.375000,22.075000,455.925000
50%,73.950000,62.600000,17.200000,62.700000,35.650000,50.400000,6.150000,16.500000,62.300000,46.550000,46.950000,47.950000,548.550000
75%,97.300000,102.550000,35.425000,77.625000,48.750000,78.025000,17.875000,26.550000,81.625000,74.500000,102.725000,107.000000,665.150000
max,261.900000,335.700000,209.800000,128.400000,149.500000,145.000000,46.800000,57.000000,122.800000,175.700000,384.600000,314.700000,1575.400000

In [15]:
df1.head(1)

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
0,A CORUNA,240.5,293.4,31.0,80.6,149.5,108.9,44.6,21.8,96.5,154.5,100.8,214.8,1536.9

In [16]:
serie = df1["region"]
serie.head()

0    A CORUNA
1    ALBACETE
2    ALICANTE
3     ALMERIA
4       ARABA
Name: region, dtype: object

In [17]:
datos1 = [10,20,30,40,50]
serie2 = pd.Series(datos1)
serie2

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [18]:
indices = ["a", "b", "c", "d", "e"]
serie3 = pd.Series(datos1,indices)
serie3

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [19]:
serie2[2]

30

In [20]:
capitales ={"españa":"madrid", "peru":"Lima", "argentina":"buenos aires"}
serie4 = pd.Series(capitales)
serie4

españa             madrid
peru                 Lima
argentina    buenos aires
dtype: object

In [21]:
data = {"id_producto":[1001,1002,1003,1003],
       "cantidad_vendida":[20, None,25,25],
       "precio":[20.5, 15.0, None,22.5]}
d=pd.DataFrame(data)
d

   id_producto  cantidad_vendida  precio
0         1001              20.0    20.5
1         1002               NaN    15.0
2         1003              25.0     NaN
3         1003              25.0    22.5

In [22]:
d.isnull() #devuelve los nulos

   id_producto  cantidad_vendida  precio
0        False             False   False
1        False              True   False
2        False             False    True
3        False             False   False

In [23]:
d.isnull().sum() # nos suma la cantidades nulas

id_producto         0
cantidad_vendida    1
precio              1
dtype: int64

In [24]:
df_eliminados = d.dropna() #elimamos los valores 
df_eliminados

   id_producto  cantidad_vendida  precio
0         1001              20.0    20.5
3         1003              25.0    22.5

In [25]:
#rellenamos los datos faltantes en las 2 columnas 
valores_nuevos = {"cantidad_vendida":0, "precio":d["precio"].mean()}
df_rellenados = d.fillna(valores_nuevos) 
df_rellenados

   id_producto  cantidad_vendida     precio
0         1001              20.0  20.500000
1         1002               0.0  15.000000
2         1003              25.0  19.333333
3         1003              25.0  22.500000

In [26]:
df_rellenados["cantidad_vendida"] = df_rellenados["cantidad_vendida"].astype(int)
df_rellenados

   id_producto  cantidad_vendida     precio
0         1001                20  20.500000
1         1002                 0  15.000000
2         1003                25  19.333333
3         1003                25  22.500000

In [27]:
#elimandor los duplicados 
df_unicos = df_rellenados.drop_duplicates(subset="id_producto")
df_unicos

   id_producto  cantidad_vendida     precio
0         1001                20  20.500000
1         1002                 0  15.000000
2         1003                25  19.333333

In [28]:
#filtrado de series 
serie5= pd.Series([5,10,15,20,25])
serie5

0     5
1    10
2    15
3    20
4    25
dtype: int64

In [29]:
filtro = serie5 > 15 #los nros de la serie mayores a 15
serie_filtrada = serie5[filtro] #indexamos los verdaderos mayores a 15
serie_filtrada

3    20
4    25
dtype: int64

In [30]:
serie6 = pd.Series(["pera","banana", "melon", "manzana"])
serie6

0       pera
1     banana
2      melon
3    manzana
dtype: object

In [31]:
print(dir(serie5))

['T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__bool__', '__class__', '__column_consortium_standard__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__float__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__int__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pandas_priority__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_agg_examples_doc', '_agg_see_also_doc', '_align_for_op', '_align_frame', '_align_series', '_append', '_arith_method', '_as_manager', '_attrs', '_binop', '_can_hold_na', '_check_inplace_and_allows_duplicate_labels', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_result', '_constructor', '_constructor_expanddim', '_constructor_expanddim_from_mgr', '_constructor_from_mgr', '_data', '_deprecate_downcast', '_dir_additions', '_dir_deletions', '_drop_axis', '_drop_labels_or_levels', '_duplicated', '_find_valid_index', '_flags', '_flex_method', '_from_mgr', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_cleaned_column_resolvers', '_get_index_resolvers', '_get_label_or_level_values', '_get_numeric_data', '_get_rows_with_mask', '_get_value', '_get_values_tuple', '_get_with', '_getitem_slice', '_gotitem', '_hidden_attrs', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_init_dict', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_cached', '_is_copy', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_is_view_after_cow_rules', '_item_cache', '_ixs', '_logical_func', '_logical_method', '_map_values', '_maybe_update_cacher', '_memory_usage', '_metadata', '_mgr', '_min_count_stat_function', '_name', '_needs_reindex_multi', '_pad_or_backfill', '_protect_consolidate', '_reduce', '_references', '_reindex_axes', '_reindex_indexer', '_reindex_multi', '_reindex_with_indexers', '_rename', '_replace_single', '_repr_data_resource_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_labels', '_set_name', '_set_value', '_set_values', '_set_with', '_set_with_engine', '_shift_with_freq', '_slice', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_latex_via_styler', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'attrs', 'autocorr', 'axes', 'backfill', 'between', 'between_time', 'bfill', 'bool', 'case_when', 'clip', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'explode', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'ge', 'get', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'interpolate', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'list', 'loc', 'lt', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'sem', 'set_axis', 'set_flags', 'shape', 'shift', 'size', 'skew', 'sort_index', 'sort_values', 'squeeze', 'std', 'struct', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_markdown', 'to_numpy', 'to_period', 'to_pickle', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [32]:
filtro2 = serie6.str.contains("m")
print(filtro2)

0    False
1    False
2     True
3     True
dtype: bool

In [33]:
print(serie6[filtro2])

2      melon
3    manzana
dtype: object

In [34]:
#agreagacion en pandas 
num = pd.Series([10,20,30,40,50,60])
print(num)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [35]:
promedio = num.mean()
print(f"el promedio es {promedio}")

el promedio es 35.0

In [36]:
total = num.sum()
print(total)

210

In [37]:
maximo=num.max()
print(maximo)

60

In [38]:
minimo=num.min()
print(minimo)

10

In [39]:
desviacion=num.std() #desvaicion estandar 
print(desviacion)

18.708286933869708

In [41]:
m=pd.read_csv("medallas.csv")
print(m)

     Oro  Plata  Bronce  Total          Pais
0    NaN    1.0     2.0      3     Argentina
1    NaN    2.0     2.0      4       Armenia
2   17.0    7.0    22.0     46     Australia
3    1.0    1.0     5.0      7       Austria
4    NaN    3.0     4.0      7    Azerbaijan
..   ...    ...     ...    ...           ...
88   NaN    1.0     NaN      1  Turkmenistan
89   2.0    1.0     1.0      4        Uganda
90   1.0    6.0    12.0     19       Ukraine
91   3.0    NaN     2.0      5    Uzbekistan
92   1.0    3.0     NaN      4     Venezuela

[93 rows x 5 columns]

In [43]:
print(m.shape)

(93, 5)

In [44]:
print(m.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Oro     65 non-null     float64
 1   Plata   69 non-null     float64
 2   Bronce  76 non-null     float64
 3   Total   93 non-null     int64
 4   Pais    93 non-null     object
dtypes: float64(3), int64(1), object(1)
memory usage: 3.8+ KB
None

In [45]:
print(m.describe())

             Oro      Plata     Bronce       Total
count  65.000000  69.000000  76.000000   93.000000
mean    4.400000   4.768116   4.934211   10.548387
std     7.633806   7.276362   6.261705   18.897617
min     1.000000   1.000000   1.000000    1.000000
25%     1.000000   1.000000   1.000000    2.000000
50%     2.000000   2.000000   2.000000    4.000000
75%     3.000000   5.000000   5.250000    8.000000
max    39.000000  41.000000  33.000000  113.000000

In [46]:
print(m.isnull().sum())

Oro       28
Plata     24
Bronce    17
Total      0
Pais       0
dtype: int64

In [50]:
#completamos los valores nulos 
m.fillna(0, inplace=True)
m.head(2)

   Oro  Plata  Bronce  Total       Pais
0  0.0    1.0     2.0      3  Argentina
1  0.0    2.0     2.0      4    Armenia

In [51]:
#transformar los datos numericos de float a enteros 
m["Oro"]=m["Oro"].astype(int)
m["Plata"]=m["Plata"].astype(int)
m["Bronce"]=m["Bronce"].astype(int)
m

    Oro  Plata  Bronce  Total          Pais
0     0      1       2      3     Argentina
1     0      2       2      4       Armenia
2    17      7      22     46     Australia
3     1      1       5      7       Austria
4     0      3       4      7    Azerbaijan
..  ...    ...     ...    ...           ...
88    0      1       0      1  Turkmenistan
89    2      1       1      4        Uganda
90    1      6      12     19       Ukraine
91    3      0       2      5    Uzbekistan
92    1      3       0      4     Venezuela

[93 rows x 5 columns]

In [52]:
#analisis de medallas de oro por pais 
top_3_oro = m.sort_values('Oro', ascending=False).head(3)
top_3_oro

    Oro  Plata  Bronce  Total                        Pais
25   39     41      33    113   Estados Unidos de America
72   38     32      18     88  Republica Popular de China
46   27     14      17     58                       Japon

In [53]:
#analisis de las medallas por pais 
filtros = m["Total"] > 10
mas_10_medallas = m[filtros]
mas_10_medallas.sort_values("Total", ascending=False)

    Oro  Plata  Bronce  Total                        Pais
25   39     41      33    113   Estados Unidos de America
72   38     32      18     88  Republica Popular de China
73    2     28      23     71                         ROC
34   22     21      22     65                Gran Bretana
46   27     14      17     58                       Japon
2    17      7      22     46                   Australia
32    1     11      16     37                     Germany
60    1     12      14     36                 Netherlands
30    1     12      11     33                      France
14    7      6      11     24                      Canada
11    7      6       8     21                      Brazil
90    1      6      12     19                     Ukraine
81    3      8       6     17                       Spain
19    7      3       5     15                        Cuba
66    4      5       5     14                      Poland
83    3      4       6     13                 Switzerland
87    2      2       9     13                      Turkey
15    2      4       6     12              Chinese Taipei
21    3      4       4     11                     Denmark
20    4      4       3     11              Czech Republic

In [56]:
d={
    "nombre":["ana", "luis","marco", "juan"],
     "edades":[25,30,22,27],
    "Cuidades":["madrid","barcelona","valencia","bilbao"]
}
dd=pd.DataFrame(d)
dd

  nombre  edades   Cuidades
0    ana      25     madrid
1   luis      30  barcelona
2  marco      22   valencia
3   juan      27     bilbao

In [62]:
#agregamos una columna nueva
dd["salario"]=[30000,45000,38000,32000]
dd

  nombre  edades   Cuidades  salario
0    ana      25     madrid    30000
1   luis      30  barcelona    45000
2  marco      22   valencia    38000
3   juan      27     bilbao    32000

In [63]:
nombres = dd["nombre"]
print(nombres)

0      ana
1     luis
2    marco
3     juan
Name: nombre, dtype: object

In [67]:
#mostramos los que son mayores de 25 años 
mayores = dd[dd["edades"] > 25]
print(mayores)

  nombre  edades   Cuidades  salario
1   luis      30  barcelona    45000
3   juan      27     bilbao    32000

In [70]:
p=pd.read_csv("Top-Películas.csv")
p.head(2)

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97

In [80]:
#ordenacion de dataframes 
p_ordenados = p.sort_values(by="rating")
p_ordenados.head(2)

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
2531,2531,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Drama,7.6,0.0,0.00
2400,2400,953.0,Minority Report,Steven Spielberg,2002.0,145.0,Acción,7.6,80.0,132.07

In [79]:
p_ordenados = p.sort_values(by="rating", ascending=False)
p_ordenados.head(2)

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97

In [74]:
p_ordenados = p.sort_values(by=["rating","recaudación(M)"], ascending=False)
p_ordenados.head(2)

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97

In [81]:
#agrapar categorias con groupby por generos y rating y el promedio
p_agrupados = p.groupby("género")["rating"].mean()
p_agrupados.head(2)

género
Acción       7.987255
Animación    7.943902
Name: rating, dtype: float64

In [82]:
p_agrupados= p.groupby("año")["recaudación(M)"].sum()
p_agrupados.sort_values(ascending=False).head(2)

año
2014.0    8015.90
2019.0    7092.95
Name: recaudación(M), dtype: float64

In [84]:
dm= pd.DataFrame({"id":[1,2,3],"nombre":["ana", "luis", "carlos"]})
dm1 = pd.DataFrame({"id":[1,2,4],"edad":[25,30,22]})

In [85]:
dm

   id  nombre
0   1     ana
1   2    luis
2   3  carlos

In [86]:
dm1

   id  edad
0   1    25
1   2    30
2   4    22

In [88]:
#funcion merge para fusionar de dataframes 
dm_combinado = pd.merge(dm, dm1,on="id")
dm_combinado

   id nombre  edad
0   1    ana    25
1   2   luis    30

In [89]:
#combinamos  dataframes con join 
j=pd.DataFrame({"salario":[12000,23000,43000],"antiguidad":[9,13,12]},index=[1,2,3])
j1=pd.DataFrame({"cuidad":["madrid", "barcelona","valencia"],"jerarquia":["baja","alta","media"]}, index=[1,2,4,])

In [90]:
j

   salario  antiguidad
1    12000           9
2    23000          13
3    43000          12

In [91]:
j1

      cuidad jerarquia
1     madrid      baja
2  barcelona      alta
4   valencia     media

In [92]:
j_unido = j.join(j1)
j_unido

   salario  antiguidad     cuidad jerarquia
1    12000           9     madrid      baja
2    23000          13  barcelona      alta
3    43000          12        NaN       NaN

In [94]:
#concatenar dataframes
c=pd.DataFrame({"nombre":["juan","gabriela","elena"],"edad":[23,31,21]})
c1=pd.DataFrame({"nombre":["carmela","max","laura"],"edad":[34,25,29]})

In [95]:
c

     nombre  edad
0      juan    23
1  gabriela    31
2     elena    21

In [96]:
c1

    nombre  edad
0  carmela    34
1      max    25
2    laura    29

In [98]:
c_concat = pd.concat([c,c1], ignore_index=True)
c_concat

     nombre  edad
0      juan    23
1  gabriela    31
2     elena    21
3   carmela    34
4       max    25
5     laura    29

In [100]:
c_concat = pd.concat([c,c1],keys=["c","c1"])
c_concat

        nombre  edad
c  0      juan    23
   1  gabriela    31
   2     elena    21
c1 0   carmela    34
   1       max    25
   2     laura    29

In [109]:
#periodos de tiempo timestamp
fechas = pd.Series(pd.date_range('20240101',periods=3))
fechas

0   2024-01-01
1   2024-01-02
2   2024-01-03
dtype: datetime64[ns]

In [110]:
# periodos de tiempo en meses
fechas = pd.Series(pd.date_range('20240101',periods=3,freq="ME"))
fechas

0   2024-01-31
1   2024-02-29
2   2024-03-31
dtype: datetime64[ns]

In [111]:
#periodos de tiempo en años 
fechas = pd.Series(pd.date_range('20240101',periods=3,freq="YE"))
fechas

0   2024-12-31
1   2025-12-31
2   2026-12-31
dtype: datetime64[ns]

In [112]:
#periodos de tiempo en horas 
fechas = pd.Series(pd.date_range('20240101',periods=3,freq="h"))
fechas

0   2024-01-01 00:00:00
1   2024-01-01 01:00:00
2   2024-01-01 02:00:00
dtype: datetime64[ns]

In [116]:
#PERIODOS DE TIEMPO EN MINUTOS 
fechas = pd.Series(pd.date_range('20240101',periods=3,freq="min"))
fechas

0   2024-01-01 00:00:00
1   2024-01-01 00:01:00
2   2024-01-01 00:02:00
dtype: datetime64[ns]

In [117]:
#PRIODOS DE TIEMPO VAN DE 5 DIAS EN 5 DIAS 
fechas = pd.Series(pd.date_range('20240101',periods=3,freq="5D"))
fechas

0   2024-01-01
1   2024-01-06
2   2024-01-11
dtype: datetime64[ns]

In [120]:
#dataframe con fechas 
mercado =pd.read_csv("Mercado+de+Valores+España.csv")
mercado.head(2)

,Ticker,Fecha,Cierre,Referencia,Volumen,Rotacion,Ultimo,Alto,Bajo,Promedio
0,ANA,02/01/2019,74.80,73.9,156300,11621188.98,74.80,75.16,72.38,74.3518
1,ANA,03/01/2019,76.34,74.8,140331,10632703.64,76.34,76.60,74.54,75.7687

In [123]:
#cambiamos el formato de fecha
mercado["Fecha"]=pd.to_datetime(mercado["Fecha"],format="%d/%m/%Y")
mercado.head(2)

,Ticker,Fecha,Cierre,Referencia,Volumen,Rotacion,Ultimo,Alto,Bajo,Promedio
0,ANA,2019-01-02,74.80,73.9,156300,11621188.98,74.80,75.16,72.38,74.3518
1,ANA,2019-01-03,76.34,74.8,140331,10632703.64,76.34,76.60,74.54,75.7687

In [125]:
mercado["Fecha"][0] # tipo de dato

Timestamp('2019-01-02 00:00:00')

In [126]:
mercado["Fecha"][44]

Timestamp('2019-03-05 00:00:00')

In [127]:
mercado["Fecha"][17].year

2019

In [129]:
mercado["Fecha"][17].month

1

In [131]:
#abrir un archivo excel
e=pd.read_excel("Compras_desde_ads.xlsx")
e.head(2)

   Id_usuario     Genero  Edad  Salario_estimado  Comprado
0    15624510  Masculino    19             19000         0
1    15810944  Masculino    35             20000         0

In [132]:
#abrir un archivo xml
x=pd.read_xml("Valores+de+acciones.xml")
x.head(2)

         date closingValue
0  01-05-2023        25,05
1  02-05-2023        24,45

In [134]:
#metodos loc selecciona filas y columnas
l=pd.DataFrame({"col1":[100,200,300],"col2":[400,500,600],"col3":[700,800,900]},
index=["fila1","fila2", "fila3"])
l

       col1  col2  col3
fila1   100   400   700
fila2   200   500   800
fila3   300   600   900

In [135]:
l.loc["fila1"]

col1    100
col2    400
col3    700
Name: fila1, dtype: int64

In [136]:
l.loc[["fila1", "fila3"]]

       col1  col2  col3
fila1   100   400   700
fila3   300   600   900

In [138]:
l.loc[l["col1"] > 150] #valores mayores a 150

       col1  col2  col3
fila2   200   500   800
fila3   300   600   900

In [139]:
#iloc
l.iloc[0]

col1    100
col2    400
col3    700
Name: fila1, dtype: int64

In [140]:
l.iloc[:,[0,1]]

       col1  col2
fila1   100   400
fila2   200   500
fila3   300   600

In [141]:
l.iloc[1:3]

       col1  col2  col3
fila2   200   500   800
fila3   300   600   900

In [142]:
v=pd.read_csv("Datos_Ventas_Tienda.csv")
v.head(2)

       Fecha    Producto  Cantidad  Precio Unitario  Total Venta
0  1/17/2023  Electrónic         7              200         1400
1   9/1/2023  Electrónic         8              200         1600

In [143]:
v1=pd.read_csv("Datos_Ventas_Tienda2.csv")
v1.head(2)

       Fecha    Producto  Cantidad  Precio Unitario  Total Venta
0  8/25/2023  Electrónic         5              200         1000
1  8/14/2023   Alimentos         9               10           90

In [146]:
#unimos los 2 dataframes 
ventas=pd.concat([v,v1],ignore_index=True)
ventas.head(2)

       Fecha    Producto  Cantidad  Precio Unitario  Total Venta
0  1/17/2023  Electrónic         7              200         1400
1   9/1/2023  Electrónic         8              200         1600

In [149]:
#cambiamos el formato de fechas 
ventas["Fecha"]=pd.to_datetime(ventas["Fecha"])
ventas.head(2)

       Fecha    Producto  Cantidad  Precio Unitario  Total Venta
0 2023-01-17  Electrónic         7              200         1400
1 2023-09-01  Electrónic         8              200         1600

In [150]:
ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Fecha            1050 non-null   datetime64[ns]
 1   Producto         1050 non-null   object
 2   Cantidad         1050 non-null   int64
 3   Precio Unitario  1050 non-null   int64
 4   Total Venta      1050 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 41.1+ KB

In [152]:
#producto mas vendido 
p_mas_vendido = ventas.groupby("Producto")["Cantidad"].sum()
p_mas_vendido = p_mas_vendido.sort_values(ascending=False)
p_mas_vendido.head(1)

Producto
Alimentos    1262
Name: Cantidad, dtype: int64

In [155]:
#cual ha sido el mes de mas ventas 
#para eso tenemos que crear una columna nueva 
meses =[]
for f in ventas["Fecha"]:
    meses.append(f.month)
ventas["Meses"]=meses
ventas.head(2)

       Fecha    Producto  Cantidad  Precio Unitario  Total Venta  Meses
0 2023-01-17  Electrónic         7              200         1400      1
1 2023-09-01  Electrónic         8              200         1600      9

In [156]:
#meses con mas ventas 
ventas_mes = ventas.groupby("Meses")["Total Venta"].sum().sort_values(ascending=False)
ventas_mes.head(1)

Meses
8    45090
Name: Total Venta, dtype: int64

In [158]:
ventas_categoria = ventas.groupby("Producto")["Total Venta"].sum()
ventas_categoria.head(5)

Producto
Alimentos      12620
Electrónic    244000
Juguetes       33390
Libros         20840
Ropa           56400
Name: Total Venta, dtype: int64

In [159]:
#guardamos el archivo en formato csv
ventas.to_csv("resumen_ventas.csv")